# taps
tap "noahgorstein/tap"
tap "ovyerus/klog"
tap "harelba/q"

# command line utilities
brew "bat"
brew "duf"
brew "dust"
brew "eza"
brew "direnv"
brew "fd"
brew "fnm"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gron"
brew "helix"
brew "htop"
brew "jo"
brew "jq"
brew "jqp"
brew "klog"
brew "mas"
brew "mycli"
brew "orbstack"
brew "prettyping"
brew "pnpm"
brew "procs"
brew "python"
brew "q"
brew "rename"
brew "ripgrep"
brew "shellcheck"
brew "sd"
brew "trash"
brew "tree"
brew "vhs"
brew "wget"
brew "zsh"
brew "zoxide"
brew "xh"

# completions
brew "bash-completion"

# casks
cask "arc"
cask "appcleaner"
cask "bartender"
cask "confectionery"
cask "fantastical"
cask "firefox"
cask "flux"
cask "fork"
cask "google-chrome"
cask "imageoptim"
cask "karabiner-elements"
cask "notunes"
cask "pika"
cask "proxyman"
cask "raycast"
cask "scroll-reverser"
cask "spotify"
cask "tableplus"
cask "the-unarchiver"
cask "visual-studio-code"
cask "warp"
cask "zed"
cask "1password"
cask "1password/tap/1password-cli"

# Mac App Store applications
mas "Battery Indicator", id: 1206020918
mas "Bear", id: 1091189122
mas "Command X", id: 6448461551
mas "Dato", id: 1470584107
mas "Day Progress", id: 6450280202
mas "Gifski", id: 1351639930
mas "Magnet", id: 441258766
mas "One Thing", id: 1604176982
mas "Pandan", id: 1569600264
mas "Spark", id: 1176895641
mas "Speediness", id: 1596706466
mas "ToothFairy", id: 1191449274
mas "Week Number", id: 6502579523
mas "Xcode", id: 497799835

# fonts
cask "font-jetbrains-mono"
