# taps
tap "github/gh"
tap "homebrew/cask-fonts"
tap "remove-bg/tap"

# command line utilities
brew "bat"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "gitmoji"
brew "htop"
brew "imageoptim-cli"
brew "jq"
brew "mas"
brew "python"
brew "remove-bg/tap/removebg"
brew "rename"
brew "ripgrep"
brew "shellcheck"
brew "thefuck"
brew "trash"
brew "tree"
brew "vim"
brew "wget"
brew "zsh"

# completions
brew "bash-completion"
brew "docker-completion"
brew "docker-compose-completion"

# casks
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "dash"
cask "docker"
cask "dropbox"
cask "fantastical"
cask "firefox"
cask "flux"
cask "fork"
cask "glyphfinder"
cask "google-chrome"
cask "hyper"
cask "imageoptim"
cask "karabiner-elements"
cask "numi"
cask "visual-studio-code"
cask "sizzy" 
cask "slack" 
cask "spotify"
cask "the-unarchiver"
cask "1password"

# Mac App Store applications
mas "Battery Indicator", id: 1206020918
mas "Bear", id: 1091189122
mas "Breaks for Eyes", id: 1439431081 
mas "Dato", id: 1470584107
mas "Magnet", id: 441258766
mas "Spark", id: 1176895641

# Quick Look plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "suspicious-package"
cask "qlvideo"

# fonts
cask "font-jetbrains-mono"
