# taps
tap "github/gh"
tap "homebrew/cask-fonts"
tap "jesseduffield/lazygit"
tap "noahgorstein/tap"
tap "remove-bg/homebrew-tap"
tap "oven-sh/bun"

# command line utilities
brew "bat"
brew "bun"
brew "choose-rust"
brew "direnv"
brew "dog"
brew "duf"
brew "dust"
brew "exa"
brew "fd"
brew "fnm"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "gitmoji"
brew "git-delta"
brew "htop"
brew "imageoptim-cli"
brew "jo"
brew "jq"
brew "jqp"
brew "mas"
brew "lazygit"
brew "prettyping"
brew "pnpm"
brew "procs"
brew "python"
brew "removebg"
brew "rename"
brew "ripgrep"
brew "shellcheck"
brew "sd"
brew "thefuck"
brew "trash"
brew "tree"
brew "vim"
brew "vhs"
brew "wget"
brew "zsh"
brew "zoxide"
brew "xh"

# completions
brew "bash-completion"
brew "docker-completion"
brew "docker-compose-completion"

# casks
cask "appcleaner"
cask "bartender"
cask "dash"
cask "docker"
cask "dropbox"
cask "fantastical"
cask "firefox"
cask "flux"
cask "fork"
cask "google-chrome"
cask "imageoptim"
cask "karabiner-elements"
cask "numi"
cask "removebg"
cask "slack" 
cask "spotify"
cask "the-unarchiver"
cask "visual-studio-code"
cask "warp"
cask "1password"

# Mac App Store applications
mas "Battery Indicator", id: 1206020918
mas "Bear", id: 1091189122
mas "Dato", id: 1470584107
mas "Magnet", id: 441258766
mas "Spark", id: 1176895641

# Quick Look plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "suspicious-package"
cask "qlvideo"

# fonts
cask "font-jetbrains-mono"
